---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.#ctor
source: html/2c77b4ba-6c4b-b2a1-70c9-b98e099e8591.htm
---
# Autodesk.Revit.DB.DetailCurveArray.#ctor Method

Initializes a new instance of the DetailCurveArray class

## Syntax (C#)
```csharp
public DetailCurveArray()
```